erik-elemind/monorepo/board/pin_mux.h
/*! @name PIO0_11 (coord L1), EEG_PWDn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_EEG_PWDn_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_EEG_PWDn_SIGNAL PIO0                        /*!<@brief Signal name */
#define BOARD_INITPINS_EEG_PWDn_CHANNEL 11                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EEG_PWDn_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EEG_PWDn_GPIO_PIN_MASK (1U << 11U)          /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_EEG_PWDn_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EEG_PWDn_PIN 11U                            /*!<@brief PORT pin number */
#define BOARD_INITPINS_EEG_PWDn_PIN_MASK (1U << 11U)               /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name ADC0_0 (coord F4), TEMP_SENSE_BAND
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_TEMP_SENSE_BAND_PERIPHERAL ADC0         /*!<@brief Peripheral name */
#define BOARD_INITPINS_TEMP_SENSE_BAND_SIGNAL CH               /*!<@brief Signal name */
#define BOARD_INITPINS_TEMP_SENSE_BAND_CHANNEL 0               /*!<@brief Signal channel */
                                                               /* @} */

/*! @name PIO1_7 (coord J15), EEG_RESETn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_EEG_RESETn_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_EEG_RESETn_SIGNAL PIO1                        /*!<@brief Signal name */
#define BOARD_INITPINS_EEG_RESETn_CHANNEL 7                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EEG_RESETn_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EEG_RESETn_GPIO_PIN_MASK (1U << 7U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_EEG_RESETn_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EEG_RESETn_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_EEG_RESETn_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO2_7 (coord U16), EEG_LDO_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_EEG_LDO_EN_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_EEG_LDO_EN_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_EEG_LDO_EN_CHANNEL 7                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EEG_LDO_EN_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EEG_LDO_EN_GPIO_PIN_MASK (1U << 7U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_EEG_LDO_EN_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EEG_LDO_EN_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_EEG_LDO_EN_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name SCT0_OUT6 (coord A2), LEDG_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LEDG_PWM_PERIPHERAL SCT0    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LEDG_PWM_SIGNAL OUT         /*!<@brief Signal name */
#define BOARD_INITPINS_LEDG_PWM_CHANNEL 6          /*!<@brief Signal channel */
                                                   /* @} */

/*! @name SCT0_OUT7 (coord B3), LEDR_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LEDR_PWM_PERIPHERAL SCT0    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LEDR_PWM_SIGNAL OUT         /*!<@brief Signal name */
#define BOARD_INITPINS_LEDR_PWM_CHANNEL 7          /*!<@brief Signal channel */
                                                   /* @} */

/*! @name PMIC_I2C_SCL (coord E16), PMIC_I2C_SCL
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_I2C_SCL_PERIPHERAL FLEXCOMM15 /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_I2C_SCL_SIGNAL SCL            /*!<@brief Signal name */
                                                          /* @} */

/*! @name PMIC_I2C_SDA (coord F16), PMIC_I2C_SDA
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_I2C_SDA_PERIPHERAL FLEXCOMM15 /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_I2C_SDA_SIGNAL SDA            /*!<@brief Signal name */
                                                          /* @} */

/*! @name PMIC_MODE1 (coord B16), PMIC_MODE1
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_MODE1_PERIPHERAL PMC      /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_MODE1_SIGNAL PMIC_MODE    /*!<@brief Signal name */
#define BOARD_INITPINS_PMIC_MODE1_CHANNEL 1           /*!<@brief Signal channel */
                                                      /* @} */

/*! @name LDO_ENABLE (coord A16), PMIC_LDO_ENABLE
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_LDO_ENABLE_PERIPHERAL PMC          /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_LDO_ENABLE_SIGNAL PMIC_LDO_ENABLE  /*!<@brief Signal name */
                                                               /* @} */

/*! @name PMIC_MODE0 (coord C15), PMIC_MODE0
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_MODE0_PERIPHERAL PMC      /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_MODE0_SIGNAL PMIC_MODE    /*!<@brief Signal name */
#define BOARD_INITPINS_PMIC_MODE0_CHANNEL 0           /*!<@brief Signal channel */
                                                      /* @} */

/*! @name PMIC_IRQ_N (coord A15), PMIC_IRQ_N
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_IRQ_N_PERIPHERAL PMC      /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_IRQ_N_SIGNAL PMIC_IRQ     /*!<@brief Signal name */
                                                      /* @} */

/*! @name FC2_RXD_SDA_MOSI_DATA (coord D6), MAX86140_SDI
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MAX86140_SDI_PERIPHERAL FLEXCOMM2           /*!<@brief Peripheral name */
#define BOARD_INITPINS_MAX86140_SDI_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
                                                                   /* @} */

/*! @name FC2_TXD_SCL_MISO_WS (coord A5), MAX86140_SDO
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MAX86140_SDO_PERIPHERAL FLEXCOMM2         /*!<@brief Peripheral name */
#define BOARD_INITPINS_MAX86140_SDO_SIGNAL TXD_SCL_MISO_WS       /*!<@brief Signal name */
                                                                 /* @} */

/*! @name FC2_SCK (coord A3), MAX86140_SCK
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MAX86140_SCK_PERIPHERAL FLEXCOMM2 /*!<@brief Peripheral name */
#define BOARD_INITPINS_MAX86140_SCK_SIGNAL SCK           /*!<@brief Signal name */
                                                         /* @} */

/*! @name ADC0_9 (coord G3), ADC_NTC1
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_NTC1_PERIPHERAL ADC0  /*!<@brief Peripheral name */
#define BOARD_INITPINS_ADC_NTC1_SIGNAL CH        /*!<@brief Signal name */
#define BOARD_INITPINS_ADC_NTC1_CHANNEL 9        /*!<@brief Signal channel */
                                                 /* @} */

