erik-elemind/monorepo/board/pin_mux.h
/*! @name ADC0_2 (coord A1), VBATT_SENSE
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_VBATT_SENSE_PERIPHERAL ADC0     /*!<@brief Peripheral name */
#define BOARD_INITPINS_VBATT_SENSE_SIGNAL CH           /*!<@brief Signal name */
#define BOARD_INITPINS_VBATT_SENSE_CHANNEL 2           /*!<@brief Signal channel */
                                                       /* @} */

/*! @name PIO2_0 (coord R11), DEBUG_LEDn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_LEDn_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_LEDn_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_DEBUG_LEDn_CHANNEL 0                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DEBUG_LEDn_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DEBUG_LEDn_GPIO_PIN_MASK (1U << 0U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_DEBUG_LEDn_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_LEDn_PIN 0U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_LEDn_PIN_MASK (1U << 0U)                /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO2_1 (coord T11), BLE_RESETn
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_BLE_RESETn_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_BLE_RESETn_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_BLE_RESETn_CHANNEL 1                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BLE_RESETn_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BLE_RESETn_GPIO_PIN_MASK (1U << 1U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BLE_RESETn_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BLE_RESETn_PIN 1U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_BLE_RESETn_PIN_MASK (1U << 1U)                /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO2_2 (coord U11), BOOST_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_BOOST_EN_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINS_BOOST_EN_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_INITPINS_BOOST_EN_CHANNEL 2                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOST_EN_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOST_EN_GPIO_PIN_MASK (1U << 2U)           /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BOOST_EN_PORT 2U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOOST_EN_PIN 2U                             /*!<@brief PORT pin number */
#define BOARD_INITPINS_BOOST_EN_PIN_MASK (1U << 2U)                /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name SCT0_OUT8 (coord C1), LED_B_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LED_B_PWM_PERIPHERAL SCT0    /*!<@brief Peripheral name */
#define BOARD_INITPINS_LED_B_PWM_SIGNAL OUT         /*!<@brief Signal name */
#define BOARD_INITPINS_LED_B_PWM_CHANNEL 8          /*!<@brief Signal channel */
                                                    /* @} */

/*! @name PIO0_18 (coord B7), USER_BUTTON1
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_USER_BUTTON1_PERIPHERAL PINT           /*!<@brief Peripheral name */
#define BOARD_INITPINS_USER_BUTTON1_SIGNAL PINT               /*!<@brief Signal name */
#define BOARD_INITPINS_USER_BUTTON1_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITPINS_USER_BUTTON1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON1_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_USER_BUTTON1_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name ADC0_1 (coord E3), MEMS_BYPASS
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MEMS_BYPASS_PERIPHERAL ADC0     /*!<@brief Peripheral name */
#define BOARD_INITPINS_MEMS_BYPASS_SIGNAL CH           /*!<@brief Signal name */
#define BOARD_INITPINS_MEMS_BYPASS_CHANNEL 1           /*!<@brief Signal channel */
                                                       /* @} */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
